app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = 9  [["description", "Everybody Duanes, you Duane, I Duane, we all Duane"], ["updated_at", Thu, 06 Nov 2014 02:26:08 UTC +00:00]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if  @event.save